print('Выберите короче, что хотите и побыстрее')
print('1 - сложение')
print('2 - вычитание')
print('3 - умножение')
print('4 - деление')
print('5 - ну там, короче в степень возводить, не знаю зачем, но просто чтобы был, надо')
number = int(input())
if number == 1:
    print('Ваше первое число, мусье')
    a = int(input())
    print('А теперь давай второе')
    b = int(input())
    print('ИТОГООО, у нас тут')
    print(a+b)
else:
    if number == 2:
        print('Ваше первое число, мисье мусьё')
        a = int(input())
        print('Го теперь второе давай')
        b = int(input())
        print('Ну могло быть и хуже...')
        print(a - b)
    else:
        if number == 3:
            print('Ваше первое число, мистер мисье мусье')
            a = int(input())
            print('Там ещё вроде второе нужно, а ну давай')
            b = int(input())
            print('Хм.....')
            print(a * b)
        else:
            if number == 4:
                print('Ваше первое число, вы мистер мисье мусье')
                a = int(input())
                print('Жду второе,ну можно канеш не торопиться, но желательно было бы побыстрее')
                b = int(input())
                print('Дождался,вот получай')
                print(a / b)
            else:
                if number == 5:
                    print('Ваше первое число, мусье')
                    a = int(input())
                    print('А теперь давай второе, шучу, не нужно, просто в какой степени тебе всё это подавать?')
                    b = int(input())
                    print('Зачем канеш сюда полез, не знаю, но да ладно, я не жалуюсь, ведь я НАРУТО УЗУМАКИИИИ')
                    print('А да, вот что получилось')
                    print(a**b)
print('                                                                                                                                               (╯ ° □ °) ╯ (┻━┻)                     ')
